---
layout: single
title: "함수형 프로그래밍 개념"
---

함수형 프로그래밍이라는 개념은 아주 오래전부터 등장했다. 함수형 프로그래밍은 수학의 원리와 밀접하게 연관이 있기 때문에 배우는데 시간이 오래걸리고 사람이 이해하는데 난해할 수도 있다.
따라서 사람의 사고방식과 가장 가까운 절차지향 프로그래밍, 객체지향 프로그래밍이 보편적으로 많이 쓰여왔다. 
그런데 왜 최근에 함수형 프로그래밍에 대한 관심을 가지게 된걸까?

AI, IoT, 빅데이터, 비트코인이 뜨기 시작하면서 방대한 데이터를 안정적이고 빠르게 처리하는 것의 중요성이 부각되면서 함수형 프로그래밍언어가 주목받기 시작했다.

# 함수형 프로그래밍이란?
함수형 프로그래밍을 파이프라인과 비유해볼 수 있는데 인풋을 넣으면 어떤 처리과정을 거쳐 아웃풋이 나온다. 외부에서는 파이프라인 내부상태를 보거나 접근할 수 없고 파이프라인 내부에서도 외부로 접근을 할 수가 없다
함수형 프로그래밍으로 프로그래밍을 만든다는 것은 이런 함수들을 적용하고 묶어서 프로그램을 구성해나가는 것을 말한다.

오래전부터 꾸준히 많이 사용되어진 객체지향 프로그래밍을 단순히 함수형 프로그래밍으로 대체할 수는 없다. 
하지만 많은 프로그래밍 언어의 최신버전에 함수형 프로그래밍의 특징들이 더해지고 있고 함수형 프로그래밍들의 특징을 잘 활용하면 더 안정성있는 프로그래밍을 해나갈 수 있다.

# 함수형 프로그래밍의 특징
## Pure Functions
## Stateless, Immutablility
## Expression Only
## First-class and higher-order functions
